source/2_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Code School</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Code School</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/9-CS-codeSchool">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="assessment.html">Assessment</a></li>

    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> What if&#x2026;</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Previously, we looked at how we can store information in variables, read it back, look at its size and find sub-strings inside other strings. 
</li>
<li>We'll now recap using IF, ELSE and ELSEIF to get the second third of the knowledge we need to solve any computationally solvable problem. 
</li>
<li>Here's an example of some simple programs using <code>If</code> statements&#x2026;
</li>
</ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #268bd2;">yourChoice</span>=<span style="color: #657b83; font-weight: bold;">int</span>(<span style="color: #657b83; font-weight: bold;">input</span>(<span style="color: #2aa198;">"Enter a number between 1 and 5: "</span>))

<span style="color: #859900; font-weight: bold;">if</span> yourChoice==1:
    <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"You chose one"</span>)
<span style="color: #859900; font-weight: bold;">elif</span> yourChoice==2:
    <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"You chose two"</span>)
<span style="color: #859900; font-weight: bold;">elif</span> yourChoice==3:
    <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"You chose three"</span>)
<span style="color: #859900; font-weight: bold;">else</span>:
    <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"You chose "</span> +  <span style="color: #657b83; font-weight: bold;">str</span>(yourChoice))

<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"That's all, folks"</span>)
</pre>
</div>

<ul class="org-ul">
<li>The user enters their choice, and the computer first checks to see if the number was 1. If it was, the computer shows the appropriate message and then leaves the <code>If</code> 'block', carrying on with the rest of the program (so you'll see 'That's all, folks')
</li>
<li>If your choice wasn't 1, it tries the next condition (did you enter 2?)
</li>
<li>Again, if you did, you'll be told what you chose, then you'll see 'That's all, folks' as the program continues its program. 
</li>
<li>If your choice wasn't 2, it tries the next condition (did you enter 3?)
</li>
<li>Just like the other two cases, if you did, you'll be told what you chose, then you'll see 'That's all, folks' as the program continues its program. 
</li>
<li>Finally, if you didn't enter 1, 2 or 3 then the if block has a catch-all (the <code>else</code>) statement, which it will use instead. It'll then carry on with the rest of the program. 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3 learn">
<h3 id="sec-1-2">Try It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>With <code>if</code> statements, you don't only have to use 'is exactly equal to' (==) when comparing things.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #268bd2;">tentacles</span>=<span style="color: #657b83; font-weight: bold;">int</span>(<span style="color: #657b83; font-weight: bold;">input</span>(<span style="color: #2aa198;">"How many tentacles do you have? "</span>))

<span style="color: #859900; font-weight: bold;">if</span> tentacles&gt;=1:
    <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"You should probably see the Doctor."</span>)
<span style="color: #859900; font-weight: bold;">else</span>:
    <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"I'm sure its nothing."</span>)
</pre>
</div>

<ul class="org-ul">
<li>You can also use &gt; and &lt; by themselves.
</li>
<li>You can use <code>!=</code> for 'is not equal to'&#x2026;
</li>
</ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"1D fan detector program"</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"-----------------------"</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">""</span>)

<span style="color: #268bd2;">albums</span>=<span style="color: #657b83; font-weight: bold;">int</span>(<span style="color: #657b83; font-weight: bold;">input</span>(<span style="color: #2aa198;">"How many One Directon albums do you own? "</span>))

<span style="color: #859900; font-weight: bold;">if</span> albums!=0:
    <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"You may be a One Direction fan. Remain calm."</span>)
<span style="color: #859900; font-weight: bold;">else</span>:
    <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"You clearly don't like Britain's favourite boy band."</span>)
</pre>
</div>

<ul class="org-ul">
<li>Strings can also be used in <code>If</code> statements. You can use <code>= and !</code>, but not &gt;, &lt;, &gt;= and &lt;= (Saying that potato &gt; horse wouldn't make any sense, for instance)
</li>
<li>You can also use <code>or</code> and <code>and</code> to set up more complex statements&#x2026;
</li>
</ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #268bd2;">yourName</span>=<span style="color: #657b83; font-weight: bold;">input</span>(<span style="color: #2aa198;">"What's your name? "</span>)

<span style="color: #859900; font-weight: bold;">if</span> yourName==<span style="color: #2aa198;">"Mr. B"</span>:
    <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"You da' man"</span>)
<span style="color: #859900; font-weight: bold;">elif</span> yourName==<span style="color: #2aa198;">"Mr. W"</span> <span style="color: #859900; font-weight: bold;">or</span> yourName==<span style="color: #2aa198;">"Mr. D"</span> <span style="color: #859900; font-weight: bold;">or</span> yourName==<span style="color: #2aa198;">"Mr. P"</span>:
    <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"Hello, Sir"</span>)
<span style="color: #859900; font-weight: bold;">elif</span> yourName==<span style="color: #2aa198;">"Mrs. E"</span>:
    <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"Hello, Mrs. E"</span>)
<span style="color: #859900; font-weight: bold;">else</span>:
    <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"How's it going?"</span>)
</pre>
</div>

<ul class="org-ul">
<li>Finally, you can nest all sorts of code (put <code>if</code> statements inside <code>if</code> statements, for instance). 
</li>
</ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #268bd2;">gender</span>=<span style="color: #657b83; font-weight: bold;">input</span>(<span style="color: #2aa198;">"What's your gender? Enter M or F: "</span>)
<span style="color: #268bd2;">YOB</span>=<span style="color: #657b83; font-weight: bold;">int</span>(<span style="color: #657b83; font-weight: bold;">input</span>(<span style="color: #2aa198;">"What year were you born (e.g. 2014): "</span>))
<span style="color: #268bd2;">yourAge</span>=2015-YOB

<span style="color: #859900; font-weight: bold;">if</span> gender==<span style="color: #2aa198;">"M"</span>: 
    <span style="color: #859900; font-weight: bold;">if</span> yourAge&gt;=20: 
        <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"You're ancient, mister!"</span>)
    <span style="color: #859900; font-weight: bold;">else</span>: 
        <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"Ok, young Sir."</span>)
<span style="color: #859900; font-weight: bold;">elif</span> gender==<span style="color: #2aa198;">"F"</span>:
    <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"My good lady, I never would have guessed."</span>)
<span style="color: #859900; font-weight: bold;">else</span>: 
    <span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"You didn't choose male or female."</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3 badge">
<h3 id="sec-1-3">Badge It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><b>Silver:</b> Write a 'Guess what number I'm thinking of game. 
<ul class="org-ul">
<li>The number to be guessed will be 7.
</li>
<li>If the player guesses too low or high, they should see a message saying so, and encouraging them to run the game again.
</li>
<li>If they guess correctly, a message of congratulations should appear.
</li>
</ul>
</li>
<li><b>Gold:</b> 
<ul class="org-ul">
<li>Modify the program to say how far out they are. If they typed 8, the program should say 'you're 1 out of getting it right', rather than simply higher or lower. 
</li>
</ul>
</li>
<li><b>Platinum:</b> 
<ul class="org-ul">
<li>Modify the program to choose random numbers. 
</li>
<li>You'll need to <a href="http://lmgtfy.com/?q=random+numbers+in+python+3">research</a> how to do this online.
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
